// Задание 3: Поиск среднего значения массива
// Описание: Задайте массив из 10 целых чисел. Найдите среднее значение элементов
// массива.

int[] array = { 1, 3, 5, 7, 9, 11, 20, 66, 89, 92 }; // Sum = 303;

double sum = array.Sum();
double Result = sum / array.Length;
Console.WriteLine(Result);



